That'll have same effect as what is happening now, as the key is being set as the username? - `key.username => key`

I applied manually, so this was the change.

```
Terraform will perform the following actions:

  # cloudflare_record.dids["nico"] will be created
  + resource "cloudflare_record" "dids" {
      + allow_overwrite = true
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "nico"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "TXT"
      + value           = "did=did:plc:owjzh2rgyrwchftot3hzmgku"
      + zone_id         = "ece81bdc8196d1bcb85e7b5ad25846bb"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

If you `dig +short TXT @162.159.44.193 nico.bsky.nz`, you'll see the TXT record. Propagation is taking longer than I thought it would...